Revit 2024 API
Gutter.GutterType Property
Retrieves/set an object that represents the type of the Gutter.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public GutterType GutterType { get; set; }
Visual Basic
Public Property GutterType As GutterType
	Get
	Set
Visual C++
public:
property GutterType^ GutterType {
	GutterType^ get ();
	void set (GutterType^ value);
}
See Also
Gutter Class
Autodesk.Revit.DB.Architecture Namespace